//Global story tags
# title: Мастацтва клінка
# frequency: Special
# development: false
# illustration: roadpoint2

INCLUDE include.ink

VAR PlayerWin = false
VAR MetBefore = true
    ~ MetBefore = GetPlayerHasCustomTag("MetVittorio")
VAR DeniedBefore = true
    ~ DeniedBefore = GetPlayerHasCustomTag("DeniedVittorio")
    
    ~ SetTextVariable("MetBefore",MetBefore)
    ~ SetTextVariable("DeniedBefore1",DeniedBefore)
    ~ SetTextVariable("DeniedBefore2",DeniedBefore)
    ~ SetTextVariable("MetBefore2",MetBefore)

->START

===START===
Вы працягваеце падарожжа зьвілістай дарогай, і кожны ваш крок суправаджае ціхае шапаценьне ветрыку.#STR_Start1
Раптам вашую ўвагу прыцягвае мерны тупат крокаў. Узняўшы позірк, {not MetBefore: вы заўважаеце таямнічага незнаёмца, які набліжаецца ўпэўненай хадой. Калі ён падыходзіць бліжэй, вашае вока ловіць бляск вытанчанай рапіры. Незнаёмец спыняецца перад вамі й ацэньвае вас позіркам, прыязна ўсьміхаючыся.}{MetBefore:  вы заўважаеце знаёмую постаць Віторыё дэ Люкі, славутага тылійскага дуэлянта, які ўпэўнена крочыць да вашай партыі. {not DeniedBefore: У памяці ажывае вашая мінулая сустрэча, і вы зноў адчуваеце хваляваньне першага двубою.}} #illustration: stranger #STR_Start2
{not MetBefore: «Ах, якая ўдача — сустрэць годных ваяроў на гэтай пустэльнай дарозе, — кажа ён. — Я Віторыё дэ Люка, майстар клінка з далёкай Тыліі. Я аб'езьдзіў шмат краёў у пошуках годнага суперніка, які мог бы зраўнацца са мной у баі. І вось лёс прывёў мяне да вас. Ці не жадаеце паказаць сваё майстэрства ў сяброўскім двубоі, зь невялікай закладкай дзеля азарту?»#STR_Start3NotMetBefore} 
{MetBefore: Калі Віторыё падыходзіць бліжэй, вашае вока ловіць бляск ягонай вытанчанай рапіры, а на твары дуэлянта зьяўляецца прыязная ўсьмешка. «Ах, якая ўдача — зноў сустрэцца на гэтай пустэльнай дарозе, — кажа ён з гарэзьлівымі ноткамі ў голасе. — Бачу, агонь ваяра ўсё яшчэ гарыць у вас. {not DeniedBefore: Ці не жадаеце зноў паказаць сваё майстэрства ў паўторным двубоі?»} {DeniedBefore: Ці не жадаеце гэтым разам паказаць сваё майстэрства?»}#STR_Start3MetBefore} 
~ SetPlayerCustomTag("MetVittorio") 
-> choices

=choices
*[Прыняць выклік.] ->accept
*[Можа, іншым разам. У нас няма лішняга часу.] -> deny

=accept
{not MetBefore: Зацікавіўшыся прапановай, вы ўсьміхаецеся ў адказ, жадаючы даведацца пра стаўкі. #STR_AcceptNotMetBefore1}
{not MetBefore: «Двубой з закладкай? Я слухаю», — адказваеце вы, гатовыя абмеркаваць прапанову. #STR_AcceptNotMetBefore2}
{not MetBefore: Вочы дуэлянта загараюцца прадчуваньнем, калі ён тлумачыць умовы. «Калі вы пераможаце, я аддам вам 5000 залатых манэтаў у знак прызнаньня вашага майстэрства. Калі ж перамога будзе за мной, я не папрашу нічога, апроч гонару выпрабаваць сваё майстэрства супраць вашага».#STR_AcceptNotMetBefore3}
З азартам у вачах і рашучай усьмешкай вы прымаеце выклік дуэлянта. «Добра, — кажаце вы, — я прымаю вашую прапанову, Віторыё дэ Люка. Няхай гэты двубой {MetBefore: зноў} запомніцца нам надоўга». #STR_Accept1
Пад ухвальныя воклічы сваіх паплечнікаў вы загадваеце ім разьбіць лягер пры дарозе й ператварыць паляну ў імправізаваную арэну. #illustration: meadow #STR_Accept2
Калі арэна гатовая, вы выходзіце ў сярэдзіну, і сэрца калоціцца ў прадчуваньні бою. Вашыя ваяры зьбіраюцца ў кола паглядзець на спаборніцтва; на іхных тварах — хваляваньне й гонар. #STR_Accept3
->enterArena

=deny
~ SetPlayerCustomTag("DeniedVittorio")
Віторыё захоўвае спакойны выраз твару, але ў кутках ягоных вуснаў зьяўляецца ледзь заўважная ўсьмешка. #STR_Deny1
«Шкада, — адказвае ён зь лёгкай паблажлівасьцю ў голасе. — Я спадзяваўся знайсьці кагосьці вартага майго часу, але, відаць, чуткі пра вашае майстэрства былі перабольшаныя». #STR_Deny2
Віторыё дэ Люка разьвітваецца пагардлівым паклонам. У ягоных вытанчаных, пыхлівых рухах адчуваецца непахісная ўпэўненасьць ва ўласнай перавазе. #STR_Deny3
->END

=enterArena
~ OpenDuelMission()
...
{PlayerWin: Калі звон мячоў сьціхае, навокал гучаць радасныя воклічы вашых ваяроў, якія вітаюць цяжка здабытую перамогу. {SetPlayerCustomTag("DefeatedVittorio")}#STR_PlayerWin1}
{PlayerWin: Вы стаіце пасярод імправізаванай арэны, цяжка дыхаючы ад напружаньня й трыюмфу. Віторыё дэ Люка, славуты тылійскі дуэлянт, з павагай працягвае руку, і ягоны твар асьвятляе шчырая ўсьмешка. «Вы добра біліся», — кажа ён з захапленьнем.#STR_PlayerWin2}
{PlayerWin: Сяброўства паміж вашай партыяй і Віторыё мацнее, калі ён высакародна ўручае вам 5000 залатых манэтаў, выконваючы ўмовы закладкі й прызнаючы вашае майстэрства. {GiveGold(5000)}#STR_PlayerWin3} 
{not PlayerWin: Двубой сканчаецца, пакідаючы супярэчлівыя пачуцьці. Вашыя ваяры з маўклівай павагай глядзяць, як Віторыё дэ Люка, славуты тылійскі дуэлянт, выходзіць пераможцам з зацятага спаборніцтва.#STR_PlayerLost1}
{not PlayerWin:Вы адступаеце й кіўком прызнаяце ягонае майстэрства. Віторыё стаіць пасярод імправізаванай арэны, ягоная рапіра зьзяе ў згасальным сьвятле, а твар упрыгожвае пераможная ўсьмешка. «Сапраўды грозны супернік, — кажа ён з гонарам за свой посьпех. — Вы біліся мужна, але гэтым разам перамога мая».#STR_PlayerLost2}
Віторыё дэ Люка з павагай разьвітваецца з вашай партыяй. Незалежна ад выніку двубою, ягоныя манеры й словы застаюцца аднолькава вытанчанымі. #STR_DuelEnd
->END