//Global story tags
# title: Бос прачынаецца
# frequency: Special
# development: false
# illustration: orc_boss_career_2

INCLUDE include.ink

//Variables setup
VAR QuestToStart = ""

->START

===START===
Гэта прыходзіць раптам — ня думка й не пачуцьцё. Нешта бліжэйшае да інстынкту. Сэрца пачынае біцца хутчэй. Унутры нешта варушыцца: азарт. Нецярпеньне. Трэба рухацца. Трэба ЗАБІВАЦЬ.

Голас шэпча, а потым раве. Ён падганяе вас.

«Больфы… ліпфы… мацнійфы… забівай… ЗАБІВАЙ… ВААААААААААААААГХ!»

Знак багоў? Голас вядзе вас, гоніць наперад. Праігнараваць яго — значыць наклікаць гнеў саміх Горка й Морка.

Багі абралі вас. ВАС. Далі шанец паказаць сябе перад імі.
Вы мусіце ўзвысіцца. Прыняць выклікі. Разьбіць усё. Але найперш вы мусіце ЗАБІВАЦЬ.

+ [НУ ДАВАЙ ЗРОБІМ ЭТА!]
    ~ StartQuest("Quests.Careers.OrcBossQuest1")
    ~ CloseStory()
    -> END

    
    